[
  {
    "path": "/",
    "canonical": "/",
    "title": "Best MBA Colleges in Delhi NCR | PGDM Colleges in India | IMM",
    "description": "Institute of Marketing & Management (IMM) is a top-ranked MBA college in Delhi. Industry-focused curriculum, excellent placements, and strong alumni network."
  },
  {
    "path": "/about/imm-legacy",
    "canonical": "/about/imm-legacy",
    "title": "About Us - Legacy (Vision & Mission) | IMM",
    "description": "Learn more about us with our PGDM programs, programs and know more about our experienced faculty with strong industry connect."
  },
  {
    "path": "/about/leadership",
    "canonical": "/about/leadership",
    "title": "About Us - Leadership | IMM",
    "description": "Discover the visionary leadership at the Institute of Marketing and Management (IMM), where experienced educators and industry experts drive innovation, excellence, and career-focused learning for future business leaders."
  },
  {
    "path": "/about/advisory-board",
    "canonical": "/about/advisory-board",
    "title": "About Us - Advisory Board | IMM",
    "description": "Meet the distinguished Advisory Board of IMM Delhi—industry leaders and academic experts guiding the Institute of Marketing and Management with strategic insights and visionary leadership."
  },
  {
    "path": "/about/accreditations-awards",
    "canonical": "/about/accreditations-awards",
    "title": "About Us - Accreditations Awards | IMM",
    "description": "Discover the prestigious accreditations and awards that establish IMM as a leading business school in India. Learn why the Institute of Management Science, founded in 1969, is recognized for academic excellence and industry relevance."
  },
  {
    "path": "/about/imm-partners",
    "canonical": "/about/imm-partners",
    "title": "About Us - IMM Partners",
    "description": "Discover IMM-Partners: A legacy-driven institute empowering future leaders through innovative management education, industry partnerships, and global exposure since 1969."
  },
  {
    "path": "/programs/pgdm",
    "canonical": "/programs/pgdm",
    "title": "MBA Colleges In Delhi | B Schools In Delhi | PGDM | IMM",
    "description": "Explore AICTE-approved PGDM programs at IMM Delhi. Specializations in Marketing, Finance, HR, International Business, and more. Launch your career with industry-focused education at one of India’s top B-schools."
  },
  {
    "path": "/programs/bba",
    "canonical": "/programs/bba",
    "title": "BBA Colleges in Delhi | Private Colleges in Delhi for BBA",
    "description": "Explore the BBA program at IMM Delhi—gain industry-ready skills in marketing, management, and business strategy. Kickstart your career with one of India's top B-schools."
  },
  {
    "path": "/corporate-connect/industry-lectures-and-webinars",
    "canonical": "/corporate-connect/industry-lectures-and-webinars",
    "title": "IMM Corporate Connect - Industry Lectures and Webinars",
    "description": "Discover IMM Delhi's strong corporate connect through expert-led industry lectures and webinars. Gain real-world insights, network with professionals, and stay ahead in the business world."
  },
  {
    "path": "/corporate-connect/industry-visit",
    "canonical": "/corporate-connect/industry-visit",
    "title": "IMM Corporate Connect -Industry Visit",
    "description": "Explore IMM Delhi’s Corporate Connect through exciting industry visits that bridge classroom learning with real-world business exposure. Discover how IMM prepares students for corporate success."
  },
  {
    "path": "/corporate-connect/corporate-events",
    "canonical": "/corporate-connect/corporate-events",
    "title": "IMM Corporate Connect | Corporate Events",
    "description": "Discover how IMM's Corporate Connect program bridges the gap between classroom learning and industry practice through impactful corporate events, expert sessions, and networking opportunities with top business leaders."
  },
  {
    "path": "/corporate-connect/recruit-and-partner",
    "canonical": "/corporate-connect/recruit-and-partner",
    "title": "IMM Corporate Connect | Recruit and Partner",
    "description": "Explore IMM’s Corporate Connect initiative – Recruit and Partner with the Institute of Marketing and Management (IMM) to access industry-ready talent, foster innovation, and build strong corporate-academic partnerships for future growth."
  },
  {
    "path": "/faculty-and-research/faculty",
    "canonical": "/faculty-and-research/faculty",
    "title": "IMM Faculty and Research - Faculty",
    "description": "Discover the expert faculty at IMM, combining academic excellence and industry experience to drive innovative research and deliver quality management education."
  },
  {
    "path": "/faculty-and-research/research",
    "canonical": "/faculty-and-research/research",
    "title": "IMM Faculty and Research - Research",
    "description": "Explore the expert faculty and cutting-edge research initiatives at IMM. Discover how the Institute of Marketing and Management fosters innovation and academic excellence through impactful research."
  },
  {
    "path": "/life-at-imm/events-and-activities",
    "canonical": "/life-at-imm/events-and-activities",
    "title": "Life at IMM - Events and Activities",
    "description": "Discover vibrant life at IMM with exciting events, workshops, cultural activities, and industry interactions that enrich student experience and foster holistic development."
  },
  {
    "path": "/life-at-imm/clubs-at-imm",
    "canonical": "/life-at-imm/clubs-at-imm",
    "title": "Life at IMM- Clubs at IMM",
    "description": "Experience vibrant campus life at IMM with diverse student clubs that foster leadership, creativity, and teamwork. Discover how clubs at IMM enrich your academic journey and build lifelong skills."
  },
  {
    "path": "/life-at-imm/gallery",
    "canonical": "/life-at-imm/gallery",
    "title": "Life at IMM- gallery",
    "description": "Explore the vibrant life at IMM through our gallery showcasing student activities, campus events, and memorable moments that define the IMM experience."
  },
  {
    "path": "/placements/campus-recruitment",
    "canonical": "/placements/campus-recruitment",
    "title": "IMM Placements - Campus Recruitment",
    "description": "Explore IMM Delhi’s campus recruitment success with top companies hiring from Institute of Marketing and Management. Discover placement stats, recruiters, and career opportunities at IMM."
  },
  {
    "path": "/placements/placement-records",
    "canonical": "/placements/placement-records",
    "title": "IMM Placement - Placement Records",
    "description": "Explore the latest IMM placement records showcasing top recruiters, high salary packages, and successful career opportunities for graduates from the Institute of Marketing and Management (IMM), Delhi."
  },
  {
    "path": "/alumni/dazzling-divas",
    "canonical": "/alumni/dazzling-divas",
    "title": "IMM Alumni - Dazzling Divas",
    "description": "Discover the inspiring journeys of IMM Alumni - Dazzling Divas, showcasing powerful women leaders who have transformed their careers with IMM’s world-class education and mentorship."
  },
  {
    "path": "/alumni/hall-of-fame",
    "canonical": "/alumni/hall-of-fame",
    "title": "IMM Alumni - Hall of Fame",
    "description": "Discover the inspiring success stories of IMM alumni featured in the Hall of Fame. See how graduates of the Institute of Marketing and Management (IMM) have made their mark across industries worldwide."
  },
  {
    "path": "/",
    "canonical": "/",
    "title": "IMM Alumni",
    "description": "Discover the achievements and success stories of IMM alumni who have excelled in marketing, management, and business sectors. Join a strong network of professionals shaped by the Institute of Marketing and Management (IMM)."
  },
  {
    "path": "/career",
    "canonical": "/career",
    "title": "IMM Alumni - Career",
    "description": "Explore the successful career journeys of IMM alumni. Discover how the Institute of Marketing and Management (IMM) shapes industry-ready professionals and opens doors to diverse opportunities."
  },
  {
    "path": "/admissions",
    "canonical": "/admissions",
    "title": "IMM - Admission",
    "description": "Apply now for IMM Admission – Get into one of India's top management institutes offering industry-focused PGDM and postgraduate courses after BCom. Secure your future with IMM’s expert faculty and excellent placement opportunities."
  },
  {
    "path": "/gallery",
    "canonical": "/gallery",
    "title": "IMM- Gallery",
    "description": "Explore the IMM Gallery showcasing campus life, events, workshops, and student activities at the Institute of Marketing and Management (IMM). Get a glimpse of the vibrant academic and cultural environment that shapes future business leaders."
  },
  {
    "path": "/blog",
    "canonical": "/blog",
    "title": "IMM - Blog",
    "description": "Explore the latest IMM blogs that inform and inspire students. Discover insights on education, entrance exams, research, career guidance, and more."
  },
  {
    "path": "/privacy-policy",
    "canonical": "/privacy-policy",
    "title": "IMM - Privacy Policy",
    "description": "Read the Privacy Policy of IMM India to understand how we collect, use, and protect your personal information. Your privacy is our priority."
  },
  {
    "path": "/contact-us",
    "canonical": "/contact-us",
    "title": "IMM  - Contact Us",
    "description": "Reach out to IMM Delhi for MBA admissions & inquiries. Get in touch with our office now to know our working hours and location."
  },
  {
    "path": "/disclaimer",
    "canonical": "/disclaimer",
    "title": "IMM - Disclaimer",
    "description": "Read the official disclaimer of IMM India outlining the accuracy, limitations, and usage terms of the information provided on our website."
  },
  {
    "path": "/aicte-approval",
    "canonical": "/aicte-approval",
    "title": "IMM - AICTE Approval Letter",
    "description": "Please download and verify the AICTE Approval Letter for your institute. Ensure compliance with AICTE norms and maintain transparency for quality technical education in India."
  },
  {
    "path": "/feedback",
    "canonical": "/feedback",
    "title": "IMM- Feedback",
    "description": "Read genuine student feedback and reviews about the Institute of Marketing and Management (IMM). Discover insights on courses, faculty, placements, and overall experience at IMM Delhi."
  },
  {
    "path": "/nirf",
    "canonical": "/nirf",
    "title": "IMM- NIRF Documents",
    "description": "Access the latest NIRF documents for the Institute of Marketing and Management (IMM) Delhi. Explore IMM’s rankings, accreditation details, and official reports for academic excellence and transparency."
  },
  {
    "path": "/alumni/alumni-mentorship-program",
    "canonical": "/alumni/alumni-mentorship-program",
    "title": "IMM- Alumni Mentorship Program",
    "description": "Connect with experienced alumni through the IMM Alumni Mentorship Program — gain guidance, industry insights, and career support to shape your professional journey."
  },
  {
    "path": "/alumni/dazzling-divas-and-hall-of-fame",
    "canonical": "/alumni/dazzling-divas-and-hall-of-fame",
    "title": "IMM- Dazzling Divas and Hall of Fame",
    "description": "Celebrate brilliance and achievement with IMM's Dazzling Divas and Hall of Fame — honoring exceptional talent, inspiring journeys, and empowering success across diverse fields."
  }
]